wsdl/ConsultazioneISEE.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" 
	xmlns:wsa10="http://www.w3.org/2005/08/addressing" 
	xmlns:tns="http://inps.it/ConsultazioneISEE" 
	xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" 
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
	xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" 
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:i0="http://tempuri.org/" 
	xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" 
	xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" 
	xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" 
	xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" 
	xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" 
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="SvcConsultazione" targetNamespace="http://inps.it/ConsultazioneISEE">
	<wsdl:types>
		<xs:schema elementFormDefault="qualified" targetNamespace="http://inps.it/ConsultazioneISEE" 
			xmlns:xs="http://www.w3.org/2001/XMLSchema">
			<xs:include schemaLocation="ConsultazioneISEE.xsd"/>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="ISvcConsultazione_ConsultazioneSogliaIndicatore_InputMessage">
		<wsdl:part name="parameters" element="tns:ConsultazioneSogliaIndicatore"/>
	</wsdl:message>
	<wsdl:message name="ISvcConsultazione_ConsultazioneSogliaIndicatore_OutputMessage">
		<wsdl:part name="parameters" element="tns:ConsultazioneSogliaIndicatoreResponse"/>
	</wsdl:message>
	<wsdl:portType name="ISvcConsultazione">
		<wsdl:operation name="ConsultazioneSogliaIndicatore">
			<wsdl:input message="tns:ISvcConsultazione_ConsultazioneSogliaIndicatore_InputMessage" wsaw:Action="http://inps.it/ConsultazioneISEE/ISvcConsultazione/ConsultazioneSogliaIndicatore"/>
			<wsdl:output message="tns:ISvcConsultazione_ConsultazioneSogliaIndicatore_OutputMessage" wsaw:Action="http://inps.it/ConsultazioneISEE/ISvcConsultazione/ConsultazioneSogliaIndicatoreResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="BasicHttpBinding_ISvcConsultazione" type="tns:ISvcConsultazione">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="ConsultazioneSogliaIndicatore">
			<soap:operation soapAction="http://inps.it/ConsultazioneISEE/ISvcConsultazione/ConsultazioneSogliaIndicatore" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="SvcConsultazione">
		<wsdl:port name="BasicHttpBinding_ISvcConsultazione" binding="tns:BasicHttpBinding_ISvcConsultazione">
			<soap:address location="http://localhost:57448/SvcConsultazione.svc"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>